#include<stdio.h>
#define ARRAY_SIZE 5

int main(void) {

	int i, a[ARRAY_SIZE], b[ARRAY_SIZE];
	int* p;
	
	//①インデックスを主体にして「i番目のアドレスはどこか？」と毎回探す方法
	for (i = 0;i < ARRAY_SIZE;i++) {
		p = &a[i];//ｉ番目の住所を毎回メモpに書き写す
		*p = i;//その住所（a[i]）に行ってｉの値を書き込む
	}

	//②ポインタを主体にして「最初のｱﾄﾞﾚｽだけ教えて、あとは隣に移動」する方法
	for (i = 0, p = &b[0];i < ARRAY_SIZE;i++, p++){
		*p = i;//ループ開始前に配列最初の住所(&b[0])をメモpに書く
				//iを1増やすと同時に、ポインタ1つ隣のアドレスに進める(4ﾊﾞｲﾄ分)
				//そして今いる住所の場所を見に行ってiの値を書き込む。
		printf("a[%d]=%d,b[%d]=%d,&a[%d]=%d,&b[%d]=%d\n"
			, i, a[i], i, b[i], i,&a[i],i, p);
}
	printf("\n");

	for (i = 0;i < ARRAY_SIZE;i++) {
		printf("a[%d]=%d,b[%d]=%d,&a[%d]=%d,&b[%d]=%d\n"
			, i, a[i], i, b[i], i, p,i,p);
	}

	return 0;
}
/*【実行結果】
a[0]=0,b[0]=0,&a[0]=-615516712,&b[0]=-615516712
a[1]=1,b[1]=1,&a[1]=-615516708,&b[1]=-615516708
a[2]=2,b[2]=2,&a[2]=-615516704,&b[2]=-615516704
a[3]=3,b[3]=3,&a[3]=-615516700,&b[3]=-615516700
a[4]=4,b[4]=4,&a[4]=-615516696,&b[4]=-615516696

a[0]=0,b[0]=0,&a[0]=-615516692,&b[0]=-615516692
a[1]=1,b[1]=1,&a[1]=-615516692,&b[1]=-615516692
a[2]=2,b[2]=2,&a[2]=-615516692,&b[2]=-615516692
a[3]=3,b[3]=3,&a[3]=-615516692,&b[3]=-615516692
a[4]=4,b[4]=4,&a[4]=-615516692,&b[4]=-615516692
*/